class Messages:
    firstPhrase = 'А пошук не працює? @gsc_prukol'
    printing = """Друкує t.me/Evgennyy 3-19"""
    fullNameManager = 'Олена Вікторівна (в телеграмі підписана як "Елена")'
    helloReply = 'Hello world!'
    helloNewMembers = 'Привіт) Вітаю в нашому неламповому чатіку'


class Regexp:
    printing = '.*(где|кто|де|хто|(в|у) кого).*(печат|друк|принт).*'
    clinic = "(.*(?:телефон|номер|работает).*(поліклінік|поликлиник|регистрат|реєстрат).*)|(.*(поліклінік|поликлиник|регистратур|реєстр).*(?:телефон|номер|работает).*)"
    numberManager = '(який|какой|підскажіть|подскажите) номер зав(и|ы|(і|е)дую\w{0,4})'
    numberTA = '(який|какой|підскажіть|подскажите) номер (ТА|т(е|а)ть?ян(и|ы) Андр(ії|ее)вн(и|ы))\??'
    fullNameManager = "(яке?|как) (звати|звуть|ім'я|имя|фио)( (в|у))? зав(у|(і|е)дую\w{0,4})"
    fullNameCastellansha = "(яке?|как) (звати|звуть|ім'я|имя|фио)( (в|у))? кастелянш(у|и|ы)"
    hello = '(прив(і|е)т|ха(й|юшк(и|і))?|(з)?д(а|о)рова?),? бот'
